[
  {
    "chapter": "Mauryan Dynasty",
    "paragraph": "The Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever empire and provided a semblance of unity to the country.",
    "panels": [
      "A young Chandragupta Maurya holding a sword with determination",
      "Different kingdoms shown as broken pieces after invasions",
      "Magadha throne glowing as a symbol of unity"
    ]
  },
  {
    "chapter": "Ashoka",
    "paragraph": "Ashoka, once a fierce warrior, was deeply moved after the Kalinga war and embraced Buddhism, spreading peace instead of conquest.",
    "panels": [
      "Ashoka stands on a battlefield filled with fallen warriors",
      "Ashoka looks sad, haunted by the destruction",
      "Ashoka meditating under a tree, radiating peace"
    ]
  },
  {
    "chapter": "Raja Raja Chola",
    "paragraph": "Raja Raja Chola expanded the Chola empire across the seas, making the dynasty a dominant naval power.",
    "panels": [
      "Raja Raja Chola pointing towards ships ready to sail",
      "Sailors loading weapons and supplies on the fleet",
      "Chola navy ships cutting across the ocean waves"
    ]
  },
  {
    "chapter": "New Empires and Kingdoms",
    "paragraph": "After the Mauryas, new rulers like the Guptas and the Cholas rose to power. Kings such as Samudragupta expanded their kingdoms through conquests, while rulers like Harshavardhana focused on administration, welfare, and culture. Later, powerful rulers like Raja Raja Chola built strong armies, grand temples, and expanded their empire overseas.",
    "panels": [
      "Samudragupta shown as a warrior king on horseback leading soldiers",
      "Harshavardhana holding a royal court with scholars and ministers",
      "Raja Raja Chola overseeing the construction of a tall temple",
      "Chola navy ships sailing across the sea to expand trade and influence"
    ]
  },
  {
    "chapter": "Delhi Sultanate",
    "paragraph": "The Delhi Sultanate marked a new political era in medieval India, with rulers like Qutbuddin Aibak, Iltutmish, and Alauddin Khalji expanding power and building strong administrative and military systems.",
    "panels": [
      "Qutb Minar towering over Delhi as a symbol of the Sultanate",
      "Alauddin Khalji holding court with ministers and generals",
      "Soldiers of the Sultanate marching with swords and shields",
      "Traders and common people moving through the bustling markets of Delhi"
    ]
  },
  {
    "chapter": "Mughal Empire",
    "paragraph": "The Mughal Empire established one of the greatest dynasties in Indian history, with emperors like Akbar, Jahangir, Shah Jahan, and Aurangzeb shaping politics, culture, and architecture.",
    "panels": [
      "Babur leading his army with cannons and cavalry at the Battle of Panipat",
      "Akbar sitting in Diwan-i-Khas, listening to scholars of different religions",
      "Shah Jahan watching the construction of the Taj Mahal",
      "Aurangzeb inspecting his soldiers during a military campaign"
    ]
  },
  {
    "chapter": "Rulers and Buildings",
    "paragraph": "This chapter highlights how rulers expressed their power and devotion through grand architectural works like forts, palaces, mosques, and temples.",
    "panels": [
      "Shah Jahan standing with architects at the site of the Red Fort construction",
      "Skilled workers carving stone pillars for a temple",
      "The Taj Mahal glowing under the moonlight as a symbol of love",
      "A bustling construction scene with masons, laborers, and elephants carrying stones"
    ]
  },
  {
    "chapter": "Towns, Traders, and Craftspersons",
    "paragraph": "The chapter explores the growth of towns as centers of trade and crafts, with bustling markets, guilds, and links to distant lands through trade routes.",
    "panels": [
      "Caravans of traders with camels moving along a dusty trade route",
      "A crowded market where merchants sell spices, textiles, and ornaments",
      "Craftspersons weaving fine cloth and making intricate metalwork",
      "Ships loaded with goods sailing from an Indian port toward foreign lands"
    ]
  },
  {
    "chapter": "Tribes, Nomads, and Settled Communities",
    "paragraph": "This chapter describes the lives of tribes and nomadic groups, their cultural traditions, and how they interacted with settled agricultural communities.",
    "panels": [
      "Nomadic herders moving with their cattle across open grasslands",
      "A tribal leader addressing his people under a large tree",
      "Farmers cultivating fields near a settled village",
      "A clash between tribal warriors and royal armies"
    ]
  },
  {
    "chapter": "Devotional Paths to the Divine",
    "paragraph": "The chapter explains how saints, poets, and reformers spread the message of Bhakti and Sufi traditions, emphasizing love and devotion to the divine.",
    "panels": [
      "A Bhakti saint singing hymns surrounded by villagers",
      "A Sufi saint blessing devotees at a dargah",
      "Women and men of all castes sitting together listening to spiritual teachings",
      "Devotees offering flowers and prayers at a temple and a mosque"
    ]
  },
  {
    "chapter": "The Making of Regional Cultures & Eighteenth-Century Political Formations",
    "paragraph": "These chapters show how regional cultures developed through language, art, and traditions, and how the 18th century saw new kingdoms, Nawabs, and Marathas rise after the decline of the Mughal Empire.",
    "panels": [
      "Artists painting regional folk art on the walls of a palace",
      "Musicians playing sitar and tabla in a courtly gathering",
      "The Maratha cavalry charging across the battlefield",
      "A Nawab holding discussions with traders and nobles in his durbar"
    ]
  },
  {
    "chapter": "Chandragupta Maurya",
    "paragraph": "Chandragupta's father was killed in battle, leaving his mother in poverty. She fled to Pataliputra where a cowherd adopted the young prince. Here, the wise Kautilya discovered him.",
    "panels": [
      "A fierce battle scene with Chandragupta's father, the chief of Pippalivana, falling to enemy swords",
      "Chandragupta's mother, tears in her eyes, carrying baby Chandragupta through dusty roads toward Pataliputra",
      "A kind cowherd finding the mother and child, offering them shelter in his humble village home",
      "Kautilya, the wise brahman, recognizing something special in young Chandragupta's eyes"
    ]
  },
  {
    "chapter": "Alexander's Invasion",
    "paragraph": "Alexander crossed the Indus in 326 BCE and defeated King Porus at the Battle of Hydaspes. However, his soldiers refused to march further east.",
    "panels": [
      "Alexander's massive army crossing the rushing waters of the Indus River on boats and rafts",
      "The epic clash between Alexander's cavalry and King Porus riding his war elephant",
      "Alexander's exhausted soldiers sitting around campfires, shaking their heads in refusal",
      "Alexander looking eastward with frustration as his dream of conquering India fades"
    ]
  },
  {
    "chapter": 1759418453185,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A panoramic view of ancient India, showing various kingdoms and bustling cities. A map is overlaid with dotted lines highlighting the extent of Alexander's invasion in the northwest and Magadha's rising power in the east.",
      "Chanakya (also known as Kautilya), a determined-looking Brahmin, stands with a young Chandragupta in a humble setting. Chanakya's face shows cunning and resolve. Chandragupta is looking up at Chanakya with awe.",
      "A battlefield scene depicting the fall of Chandragupta's father. A village chief in simple clothes is struck down in battle. Chandragupta's mother is running away, clutching a baby to her chest.",
      "Chandragupta, now a young adult, stands tall, clad in armor. He is leading a growing army. Kautilya stands beside him, pointing the way forward with a determined expression."
    ]
  },
  {
    "chapter": 1759418544528,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A vast landscape of ancient India. A stone pillar with Mauryan inscriptions stands prominently. In the background, armies clash, dust rising into the sky. Text overlay: 'The Mauryan Dynasty - A New Era'",
      "Close-up on a stern-faced Alexander the Great leading his Macedonian army. They are visibly weary from their campaign.",
      "A stylized depiction of Magadha. The Nanda king, Dhanananda, sits on his throne, looking cruel and oppressive. Common people are shown suffering under his rule.",
      "A young Chandragupta, raised by a cowherd, stands resolute. In the background, Kautilya (Chanakya) watches him intently, a scheming look on his face. Foreshadowing his future."
    ]
  },
  {
    "chapter": 1759418655761,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A vast Indian landscape with various kingdoms scattered across the map. Alexander's army approaches from the northwest, causing chaos. A farmer looks up in fear. Magadha, in eastern India, is highlighted.",
      "A dark, oppressive throne room. King Dhanananda sits on his throne, sneering. People are being whipped outside the throne room.",
      "A young Chandragupta Maurya, raised by a cowherd, practices fighting with wooden swords. Kautilya (Chanakya) watches him from a distance with a sly smile.",
      "Chandragupta, now a young man, stands triumphantly on a battlefield. The Mauryan flag flies behind him. A defeated Nanda soldier lies at his feet. Kautilya stands beside Chandragupta, giving strategic advice."
    ]
  },
  {
    "chapter": 1759418821189,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A vast, ancient Indian landscape. In the foreground, a determined Chandragupta Maurya as a young boy with fierce eyes, stands against a backdrop of an invading army led by Alexander the Great. Dust and smoke fill the air.",
      "A scholarly Chanakya (Kautilya) is deeply engrossed in writing the Arthashastra. Scrolls and ink surround him. Megasthenes, a Greek ambassador, observes him with intrigue.",
      "A dramatic, silhouetted scene of Chandragupta Maurya, now a young man, leading a rebellion against the Nanda Dynasty. Soldiers clash, and a fiery determination is visible on Chandragupta's face.",
      "Chandragupta Maurya, now a powerful emperor, sits on his throne, radiating authority. The Mauryan flag flies proudly behind him. A map of a unified India is displayed prominently."
    ]
  },
  {
    "chapter": 1759418932389,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A vast landscape of ancient India. A large, unified army marches across the plains. In the sky, the sun shines brightly, illuminating the army's advance.",
      "Close up on a weathered stone pillar with inscriptions. A scholar with a magnifying glass examines the writings.",
      "Two figures stand in a royal court. One, a Greek ambassador (Megasthenes), presents a scroll to a regal Indian king (Chandragupta Maurya). In the background, Chanakya observes with a knowing gaze.",
      "A young Chandragupta, dressed in rags, practices swordsmanship under the watchful eye of Kautilya (Chanakya). They stand against a backdrop of a burning palace, symbolizing the overthrow of the Nanda dynasty."
    ]
  },
  {
    "chapter": 1759419043547,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A panoramic view of ancient India, with a vast empire stretching across the land. Soldiers march in formation, banners waving in the wind. A grand palace is visible in the distance.",
      "Two separate panels. The top panel shows Alexander the Great leading his Macedonian army during an invasion of Northwest India. The bottom panel shows the kingdom of Magadha, with citizens cowering under the oppressive rule of Dhanananda.",
      "Kautilya (Chanakya), a wise and determined-looking Brahmin, stands over the young Chandragupta Maurya, who looks up at him with determination. They are in a humble setting.",
      "Chandragupta Maurya, now a young man, leads a rebel army. He brandishes a sword with determination, his eyes blazing with resolve. The background is filled with the chaos of battle."
    ]
  },
  {
    "chapter": 1759419089493,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A vast, detailed landscape of ancient India. Rolling hills, rivers, and small kingdoms dotted across the land. In the foreground, a group of scholars are poring over ancient texts and inscriptions.",
      "Alexander the Great, in full armor, leading his Macedonian army across the Indus River. The scene is chaotic, with soldiers clashing and kingdoms falling.",
      "A dark and oppressive scene of Magadha under the rule of Dhanananda. People are suffering under heavy taxes and cruel punishments.",
      "A young Chandragupta, raised by a cowherd, is being trained in strategy and warfare by Kautilya (Chanakya). Kautilya has a determined look on his face. In the background, a dilapidated Pippalivana is visible."
    ]
  },
  {
    "chapter": 1759419273267,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A panoramic view of ancient India with various kingdoms scattered across the land. A looming silhouette of Alexander's army approaches from the northwest.",
      "A rock with Ashokan edicts carved into it. Close up to see Chanakya hunched over a scroll, writing furiously.",
      "A young Chandragupta Maurya, looking determined, practicing sword fighting with a makeshift wooden sword. In the background, Kautilya watches him with a keen eye.",
      "Close up on Dhanananda sitting on his throne, looking arrogant and cruel. People are starving and shackled around him"
    ]
  },
  {
    "chapter": 1759419443485,
    "paragraph": "\n5 THE MAURYAS\nThe Mauryan Dynasty marked a new era in the history of India. The Mauryas established the first ever 'empire' in the history of India and thus provided a semblance of unity to the country.\nSources\nBackground\nBefore discussing the early life of Chandragupta Maurya, let us first understand the background against which he rose to make the Mauryas a formidable force in India. Alexander, the king of Macedonia had invaded India in 326 BC. His\nSome of the sources that help us to know about campaigns had dislocated many kingdoms of Mauryan India are given below: north-west India.\nArchaeological sources like the rock edicts and pillar inscriptions of Ashoka are a vital source of information.\nAs mentioned earlier in this book, Magadha, in eastern India, had emerged as a powerful state. At a time when north-western India was facing\nLiterary sources that tell us about Mauryan India Alexander's invasion, Magadha and its people were\nare:\n⚫ Indica, the account of Megasthenes, who was an ambassador of Seleucus Nicator in the court of Chandragupta Maurya, as well as accounts of other Greek writers like Strabo, Plutarch, etc. provide invaluable information.\n⚫ The treatise on statecraft called the Arthashastra by Chanakya (also known as Vishnugupta and Kautilya) supplements the information provided by Megasthenes.\n• Vishakhadatta's political drama called the Mudrarakshasa, deals with the destruction of the Nanda Dynasty and the founding of the Mauryan Dynasty. It also informs us about the social, economic and political conditions prevailing during that time.\nCHANDRAGUPTA MAURYA\n(321 BC-297 BC)\nreeling under the tyrannical rule of the Nanda king, Dhanananda.\nArmed conflict was the only way to shake off the yoke of foreign rule as well as to end the tyrannical rule of the Nandas.\nEarly life\nThe story of Chandragupta's early life and rise to power is of great interest. According to Buddhist traditions, Chandragupta's father was the chief of Pippalivana, lying between the modern Terai region in Nepal and Gorakhpur, UP. He was defeated and killed in a battle with the ruler of the neighbouring kingdom. This had reduced Chandragupta's mother to a state of poverty. She was compelled to seek\nshelter in Pataliputra. A cowherd of a nearby village adopted him. Here Kautilya (a brahman who had promised to destroy the",
    "panels": [
      "A sweeping view of ancient India. Several kingdoms are scattered across the landscape, appearing disjointed and at war with each other. Alexander's army is seen invading from the Northwest.",
      "Close-up on Chandragupta's mother fleeing with him as a baby. A fierce battle rages in the background.",
      "Chandragupta as a young boy, now being raised by a cowherd. He's playing a game of 'king' with other children, showing natural leadership qualities.",
      "Kautilya (Chanakya) watching Chandragupta from the shadows, a determined look on his face. He sees the potential for a great leader in the young boy."
    ]
  }
]